In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("test.xlsx")

In [3]:
df.head()

   SL Name  ID  Credits  CGPA        Status
0   1    A   1       54  3.96  Satisfactory
1   2    B   2       27  2.30          Poor
2   3    C   3      102  2.70          Poor
3   4    D   4      136  3.75  Satisfactory
4   5    E   5       12   NaN  Satisfactory

In [4]:
df.head(1)

   SL Name  ID  Credits  CGPA        Status
0   1    A   1       54  3.96  Satisfactory

In [5]:
df.shape

(10, 6)

In [6]:
df.columns

Index(['SL', 'Name', 'ID', 'Credits', 'CGPA', 'Status'], dtype='object')

In [7]:
x = df[['SL', 'Name', 'ID', 'Credits', 'CGPA']]

In [8]:
y = df ['Status']

In [9]:
l = list(y.unique())

In [10]:
import numpy as np
np.array(l)

array(['Satisfactory', 'Poor'], dtype='<U12')

In [11]:
df.describe()

             SL        ID     Credits     CGPA
count  10.00000  10.00000   10.000000  8.00000
mean    5.50000   5.50000   56.800000  3.04000
std     3.02765   3.02765   41.477705  0.84841
min     1.00000   1.00000    6.000000  2.00000
25%     3.25000   3.25000   29.250000  2.25750
50%     5.50000   5.50000   49.500000  3.09000
75%     7.75000   7.75000   82.500000  3.80250
max    10.00000  10.00000  136.000000  4.00000

In [12]:
df.isnull()

      SL   Name     ID  Credits   CGPA  Status
0  False  False  False    False  False   False
1  False  False  False    False  False   False
2  False  False  False    False  False   False
3  False  False  False    False  False   False
4  False  False  False    False   True   False
5  False  False  False    False  False   False
6  False  False  False    False  False   False
7  False  False  False    False  False   False
8  False  False  False    False  False   False
9  False  False  False    False   True   False

In [13]:
df.isnull().sum()

SL         0
Name       0
ID         0
Credits    0
CGPA       2
Status     0
dtype: int64

In [14]:
u = df[df['Status']=='Satisfactory']
u

   SL Name  ID  Credits  CGPA        Status
0   1    A   1       54  3.96  Satisfactory
3   4    D   4      136  3.75  Satisfactory
4   5    E   5       12   NaN  Satisfactory
5   6    F   6       36  4.00  Satisfactory
7   8    H   8       60  3.48  Satisfactory

In [15]:
u[u["Credits"]>100]

   SL Name  ID  Credits  CGPA        Status
3   4    D   4      136  3.75  Satisfactory

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   SL       10 non-null     int64
 1   Name     10 non-null     object
 2   ID       10 non-null     int64
 3   Credits  10 non-null     int64
 4   CGPA     8 non-null      float64
 5   Status   10 non-null     object
dtypes: float64(1), int64(3), object(2)
memory usage: 608.0+ bytes

In [17]:
df = df.drop(["SL"], axis=1)

In [18]:
df

  Name  ID  Credits  CGPA        Status
0    A   1       54  3.96  Satisfactory
1    B   2       27  2.30          Poor
2    C   3      102  2.70          Poor
3    D   4      136  3.75  Satisfactory
4    E   5       12   NaN  Satisfactory
5    F   6       36  4.00  Satisfactory
6    G   7       90  2.00          Poor
7    H   8       60  3.48  Satisfactory
8    I   9       45  2.13          Poor
9    J  10        6   NaN          Poor

In [19]:
df[df["CGPA"].notnull()]

  Name  ID  Credits  CGPA        Status
0    A   1       54  3.96  Satisfactory
1    B   2       27  2.30          Poor
2    C   3      102  2.70          Poor
3    D   4      136  3.75  Satisfactory
5    F   6       36  4.00  Satisfactory
6    G   7       90  2.00          Poor
7    H   8       60  3.48  Satisfactory
8    I   9       45  2.13          Poor

In [20]:
df = df.dropna(axis=0, subset = ['CGPA'])

In [21]:
df.isnull().sum()

Name       0
ID         0
Credits    0
CGPA       0
Status     0
dtype: int64

In [22]:
df["Status"].unique()

array(['Satisfactory', 'Poor'], dtype=object)

In [23]:
df["Status"] = df["Status"].map({"Satisfactory":0, 'Poor':1})
df

C:\Users\19101077\AppData\Local\Temp/ipykernel_8072/1194797125.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Status"] = df["Status"].map({"Satisfactory":0, 'Poor':1})

  Name  ID  Credits  CGPA  Status
0    A   1       54  3.96       0
1    B   2       27  2.30       1
2    C   3      102  2.70       1
3    D   4      136  3.75       0
5    F   6       36  4.00       0
6    G   7       90  2.00       1
7    H   8       60  3.48       0
8    I   9       45  2.13       1

In [26]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

In [30]:
scaler.fit(df[["Credits"]])

MinMaxScaler()

In [33]:
n_df = scaler.transform((df[["Credits"]])
n_df

SyntaxError: invalid syntax (Temp/ipykernel_8072/3185689747.py, line 2)

In [ ]:
df["Credits"] = n_df

In [ ]:
from sklean.model_selection import train